Reports/КомплектыУКонструктора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КомплектыУКонструктора</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Должности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замерщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КомплектыУКонструктора/Forms/ФормаОтчета/Ext/Form/Module.bsl
Процедура ОбновитьНаСервере()
	
	ПолеВывода.Очистить();
	
	МассивКонструкторы = Новый Массив;
	Для каждого х Из Конструкторы Цикл
	
		Если х.Пометка Тогда
			МассивКонструкторы.Добавить(х.Значение);	
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаВывода = омКонструктор.ЗаполнитьКомплектыКонструктора(Проект, Конструкторы, Истина);
	
	Для каждого ТекущийКомплект  Из омКонструктор.ЗаполнитьЗадачи_РКД_ПКД(Проект, Конструкторы) Цикл
		              
		НС = ТаблицаВывода.Добавить();
		
		НС.Комплект 						= ТекущийКомплект.ОбъектТЗ; 
		НС.ОбъектТЗНаименование				= ТекущийКомплект.ОбъектТЗНаименование; 
		НС.Сотрудник 						= ТекущийКомплект.ИсполнительСотрудник; 
		НС.СотрудникНаименование			= ТекущийКомплект.ИсполнительСотрудникНаименование; 
		НС.ТекущаяСтадияПолноеНаименование	= ТекущийКомплект.ТекущаяСтадия;
		НС.ТекущаяСтадия					= ТекущийКомплект.ТекущаяСтадияСсылка;
		НС.Рекламация						= ТекущийКомплект.Рекламация;
		НС.НормаВремени						= ТекущийКомплект.НормаВремени;
		
	КонецЦикла; 
	
	Если ВПроизводстве Тогда
		
		Для каждого ТекущийКомплект  Из омПроизводство.ПолучитьКоммплектыВПроизводстве(Проект, Конструкторы) Цикл
			
			Если ТаблицаВывода.Найти(ТекущийКомплект.ОбъектТЗ, "Комплект") = Неопределено Тогда
				
				НС = ТаблицаВывода.Добавить();
				
				НС.Комплект 						= ТекущийКомплект.ОбъектТЗ; 
				НС.ОбъектТЗНаименование				= ТекущийКомплект.ОбъектТЗНаименование; 
				НС.Сотрудник 						= ТекущийКомплект.ИсполнительСотрудник; 
				НС.СотрудникНаименование			= ТекущийКомплект.ИсполнительСотрудникНаименование; 
				НС.ТекущаяСтадияПолноеНаименование	= ТекущийКомплект.ТекущаяСтадия;
				НС.ТекущаяСтадия					= ТекущийКомплект.ТекущаяСтадияСсылка;
				НС.Рекламация						= ТекущийКомплект.Рекламация;
				НС.НормаВремени						= ТекущийКомплект.НормаВремени;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	

	ТаблицаВывода.Сортировать("СотрудникНаименование, ОбъектТЗНаименование");        
	
	СтадииВРаботеУКонструктора = омСтадииКомплектаПовтор.ПолучитьСтадииВРаботеУКонструктора();
	
	Макет = Отчеты.КомплектыУКонструктора.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ДатаПечати = "Дата печати: " + Формат(ТекущаяДата(), "ДЛФ=DDT");
	ПолеВывода.Вывести(Область);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;

	ОбластьКонструктор	= Макет.ПолучитьОбласть("Конструктор");
	Область				= Макет.ПолучитьОбласть("Комплект");
	Область1			= Макет.ПолучитьОбласть("Комплект1");
	
	ТекущийКонструктор = Неопределено;
	
	Номер = 1;
	
	Для каждого х Из ТаблицаВывода Цикл
	
		Если НЕ ТекущийКонструктор = х.Сотрудник Тогда
			
			ОбластьКонструктор.Параметры.Заполнить(х);
			ТекущийКонструктор = х.Сотрудник;
			
			ПолеВывода.Вывести(ОбластьКонструктор);	
			
		КонецЕсли;
		
		Если СтадииВРаботеУКонструктора.Найти(х.ТекущаяСтадия) = Неопределено Тогда
			текОбласть = Область;	
		Иначе
			текОбласть = Область1;	
		КонецЕсли;
		
		текОбласть.Параметры.Заполнить(х);
		текОбласть.Параметры.Номер = Номер;
		ПолеВывода.Вывести(текОбласть);
		
		Номер = Номер + 1;
		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСписокВедущихКонструкторов()

	Для каждого Ведущий Из омСотрудники.ЗаполнитьСписокСотрудниковПоДолжностям(Истина, Истина, Перечисления.Должности.ВедущийКонструктор) Цикл
	
		Для каждого х Из Ведущий.Значение Цикл
			Элементы.ВедущийКонструктор.СписокВыбора.Добавить(х.Сотрудник, х.Наименование);			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВедущихКонструкторов();
	Параметры.Свойство("ВедущийКонструктор", ВедущийКонструктор);
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонструкторов()
	
	Для каждого х Из омСотрудники.ПолучитьКонструкторовПоВедущемуКонструкторуПользователь(ВедущийКонструктор) Цикл
		Если х.Ключ = "Подразделение" Тогда
			Подразделение = х.Значение;	
		КонецЕсли;
		
		Если х.Ключ = "СписокСотрудников" Тогда
			
			Для каждого ТекущийПользователь Из х.Значение Цикл
				Конструкторы.Добавить(ТекущийПользователь.Значение, ТекущийПользователь.Представление, Истина);	
			КонецЦикла; 
			
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВедущийКонструкторПриИзменении(Элемент)
	
	Конструкторы.Очистить();
	Подразделение = Неопределено;
	
	Если ЗначениеЗаполнено(ВедущийКонструктор) Тогда
		ЗаполнитьКонструкторов();
	КонецЕсли; 
	
	ОбновитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВедущийКонструкторПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура КонструкторыПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВПроизводствеПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры
